<?php 

namespace app\components;

use Yii;

use app\components\Functions;

$function = new Functions();
if(!$function->isAdmin()) $function->redirectLogin(Yii::$app->urlManager->createUrl(['admin/login']));
?>
<div class="col-md-10">
	<div class="menu">
		<h3>Как пользоваться системой</h3>
		<div class="col-md-12">
			<h4>1. Сбор статистики</h4>
			<p>
				Основная часть статистики собирается на основе utm-меток. Для этого необходимо в рекламной кампании к url-адресу вашего сайта добавить следующую строчку:
			</p>
			<ul>
				<li><i>/?utm_source={source}&utm_medium=cpc&utm_campaign={campaign_id}.{region_name}&utm_content={ad_id}.{position_type}.{position}&utm_term={keyword}</i></li>
			</ul>
			<p>
				Здесь приведены utm метки для тестирования:
			</p>
			<ul>
				<li><i>http://адрес-сайта.ru/?utm_source=yandex&utm_medium=some+parametr&utm_campaign=кампания+123456.Москва&utm_content=объявление+123456.premium.2&utm_term=ключевая+фраза</i></li>
			</ul>
			<h4>2. Реализация сплит-тестирования (А/Б-тестов)</h4>
			<h5>Для чего нужны сплит-тесты?</h5>
			<p>
				Тестируются две очень похожие веб-страницы (страница А и страница В), которые различаются лишь одним элементом или несколькими элементами. Страницы А и В показываются различным пользователям в равных пропорциях, при этом посетители, как правило, не знают об этом. По прошествии определенного времени или при достижении определённого статистически значимого числа показов, сравниваются числовые показатели цели и определяется наиболее подходящий вариант страницы.
			</p>
			<h5>Как реализовать?</h5>
			<p>
				Необходимо в панели управления хостингом поместить ДВЕ тестируемые страницы в папку <b>views/site</b>, и как-нибудь их назвать, к примеру <b>template-1.php</b> и <b>template-2.php</b>
			</p>
			<p>
				Затем в настройках админ-панели указать название этих страниц (Поля <b>Название split шаблона (А)</b> и <b>Название split шаблона (Б)</b>) латинскими буквами <i>точно так же, как называются файлы, без указания расширения .php</i>. То есть названия наших примеров шаблонов будут <b>template-1</b> и <b>template-2</b>. Если названия шаблонов совпадать не будут, сайт не заработает, будет отображена ошибка.
			</p>
			<p>Готово!</p>
		</div>
		<div class="col-md-12">
			<h4>Статусы заявок</h4>
			<p>Их всегда можно менять вручную. Изначально они созлаются:</p>
			<ul>
				<li>В работе - клиент оставил заявку через страницу Контакты</li>
				<li>Архивная, Выполнен - создается только вручную<</li>
				<li>Зарезервирован - когда клиент перешел на страницу оплаты, но не оплатил</li>
				<li>Оплачен - клиент выбрал товар и оплатил его</li>
			</ul>
		</div>
	</div>
</div>
